Autodesk.Revit.UI.PostableCommand.RebarBendingDetail
Creates bar bending details for the selected individual rebar or sets.

Autodesk.Revit.UI.PostableCommand.ViewAnalysis
Access energy and environmental performance data in the cloud.

Autodesk.Revit.UI.PostableCommand.GenerateAnalysis
Creates the energy analytical model and generates design options and potential performance outcomes.

Autodesk.Revit.UI.PostableCommand.LoadCombinations
Adds and edits load combinations for the analytical model.

Autodesk.Revit.UI.PostableCommand.LoadCases
Adds and edits load cases for the analytical model.

Autodesk.Revit.UI.PostableCommand.MacroSecurity
Specifies the default security settings for macros in the Revit application or a document.

Autodesk.Revit.UI.PostableCommand.ExportOptionsExportSetupsDWGOrDXF
Sets export options for CAD and IFC.

Autodesk.Revit.UI.PostableCommand.ExportOptionsExportSetupsDGN
Sets export options for CAD and IFC.

Autodesk.Revit.UI.PostableCommand.ExportCADFormatsOBJ
Creates DWG, DXF, DGN, OBJ, SAT, or STL files.

Autodesk.Revit.UI.PostableCommand.ExportCADFormatsSTL
Creates DWG, DXF, DGN, OBJ, SAT, or STL files.

Autodesk.Revit.UI.PostableCommand.ExportCADFormatsACIS_SAT
Creates DWG, DXF, DGN, OBJ, SAT, or STL files.

Autodesk.Revit.UI.PostableCommand.ExportCADFormatsDGN
Creates DWG, DXF, DGN, OBJ, SAT, or STL files.

Autodesk.Revit.UI.PostableCommand.ExportCADFormatsDXF
Creates DWG, DXF, DGN, OBJ, SAT, or STL files.

Autodesk.Revit.UI.PostableCommand.ExportCADFormatsDWG
Creates DWG, DXF, DGN, OBJ, SAT, or STL files.

Autodesk.Revit.UI.PostableCommand.ExportOptionsIFCOptions
Sets export options for CAD and IFC.

Autodesk.Revit.UI.PostableCommand.ExportIFC
Saves an IFC file.

Autodesk.Revit.UI.PostableCommand.RoofByFace
Creates a roof using a non-vertical face of a mass.